app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "臭臭臭臭"], ["price", 30000], ["description", "臭臭臭好臭臭臭臭"], ["qty", 20], ["created_at", 2017-04-07 03:25:06 UTC], ["updated_at", 2017-04-07 03:25:06 UTC]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]
UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "IMG_5529.JPG"], ["updated_at", 2017-04-21 08:38:12 UTC], ["id", 91]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)