app/controllers/account/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY id DESC  [["user_id", 1]]
---
  def index
    @orders = current_user.orders.order("id DESC")

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "ed9bbd88-87fc-49a9-977b-089f57497844"], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "aasm_state" = ? WHERE "orders"."id" = ?  [["updated_at", 2017-04-13 03:27:15 UTC], ["aasm_state", "order_cancelled"], ["id", 10]]
---
  def order_cancel
    @order = Order.find_by(token: params[:id])
    @order.update(aasm_state: "user_order_cancelled")