app/views/carts/checkout.html.erb

SELECT "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ?  [["cart_id", 30]]
---
      <tbody>
        <% current_cart.cartitems.each do |product| %>