app/views/carts/index.html.erb

              <%= link_to(product_path(product.product_id)) do %>
                <% if product.product.image_url.url.present? %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]

              <p>剩餘數量： <%= product.product.qty %> </p>
              <% itemm = current_cart.cartitems.find_by(id: product) %>
---
SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ? AND "cartitems"."id" = 5 LIMIT ?  [["cart_id", 30], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]