app/controllers/cartitems_controller.rb

  def destroy
    @cart = current_cart
    @item = @cart.cartitems.find_by( params[:id])
    # @item = @cart.find_cart_item(params[:id])
    @product = @item.product
    @item.destroy
---
SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ? AND (3) LIMIT ?  [["cart_id", 30], ["LIMIT", 1]]
DELETE FROM "cartitems" WHERE "cartitems"."id" = ?  [["id", 3]]

  def update
    @cart = current_cart
    @item = @cart.cartitems.find_by(id: params[:id])
    @item.update(item_params)
---
SELECT  "cartitems".* FROM "cartitems" WHERE "cartitems"."cart_id" = ? AND "cartitems"."id" = ? LIMIT ?  [["cart_id", 31], ["id", 12], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "cartitems" SET "updated_at" = ?, "quantity" = ? WHERE "cartitems"."id" = ?  [["updated_at", 2017-04-12 07:43:02 UTC], ["quantity", 4], ["id", 11]]