app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", 2017-04-11 07:27:15 UTC], ["updated_at", 2017-04-11 07:27:15 UTC], ["token", "e1ad1a09-bd87-41b0-8cdf-706bd9df8f23"]]
---
  def create

    @order = current_user.orders.build(order_params)

    if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "e1ad1a09-bd87-41b0-8cdf-706bd9df8f23"], ["LIMIT", 1]]
---
  def show
    # @order = Order.find(params[:id])
    @order = Order.find_by(token: params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "ad683b65-a5c3-49df-9ff6-12b80195d471"], ["LIMIT", 1]]
---
  def pay_with_credit_card
    @order = Order.find_by(token: params[:id])