app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 85], ["LIMIT", 1]]
---
  def add_to_cart
    @product = Product.find(params[:id])